<p>Los literales nos sirven para tener una traducci&oacute;n en cada idioma de palabras que se repiten en cada uno, un ejemplo ser&iacute;a `secci&oacute;n` o `titulo`, si convertimos estas palabras en literales, podremos definir su traducci&oacute;n en los diferentes idiomas que tengamos. Y nosotros a&ntilde;adir&iacute;amos {L{secci&oacute;n}} Lo cual provocar&iacute;a que se buscara la traducci&oacute;n en el idioma que el usuario tiene especificado.</p>
<p>Un ejemplo de ello es cuando presentamos el t&iacute;tulo del contenido como por ejemplo /quienes_somos.html, la aplicaci&oacute;n preguntara por el literal 'quienes_somos' y si estas viendo la p&aacute;gina en franc&eacute;s se presentara el literal especificado en franc&eacute;s.</p>
<p>En caso de que no este traducido se presentara en el idioma por defecto.</p>
<p>Otro ejemplo de literal son los mensajes de la aplicaci&oacute;n como 'Contenido pendiente de traducir',&nbsp; la aplicaci&oacute;n nos permite definir estos literales en nuestro proyecto, personalizando completamente los mensajes que le llegan al usuario.</p>
<h3>Uso de los literales</h3>
<p>A parte de los literales que se generan autom&aacute;ticamente, podemos a&ntilde;adir literales a los contenidos que estemos editando, cliclamos dentro del contenido donde queramos mostrar el contenido y seleccionamos el literal que deseamos en el panel.</p>
<h3>Administraci&oacute;n de literales</h3>
<p>Una vez logeados, podemos ir al administrador de literales desde el men&uacute; administrativo. [Administrar][Literales] que nos lleva a /literales/administrar, se nos presentara un formulario que nos permite modificar los literales del idioma en que estamos viendo la pagina en estos momentos.</p>
<h3>&iquest;Como gestiona GCM los literales?</h3>
<p>Autom&aacute;ticamente GCM convierte los t&iacute;tulos de los contenidos, entradas del men&uacute;, t&iacute;tulos de secciones, mensajes del sistema, etc... en literales.</p>
<p>De forma din&aacute;mica va a&ntilde;adiendo los literales que aun no tienen traducci&oacute;n permiti&eacute;ndonos tener constancia de la falta de traducci&oacute;n y poder a&ntilde;adir los valores seg&uacute;n idioma en el administrador.</p>
<p>Hay que tener en cuenta que hay dos tipos de literales, los de la aplicaci&oacute;n (Mensajes del sistema) y los del proyecto.</p>
<p>No se permite modificar los literales de la aplicaci&oacute;n, pero sin embargo podr&iacute;amos a&ntilde;adirlos a los literales de nuestro proyecto, de esta manera cualquier literal que se presente buscara antes en los del proyecto,permitiendo una personalizaci&oacute;n total.</p>