<h2>M&eacute;todos de los m&oacute;dulos para incluir javascript</h2>
<p>Tenemos tres metodos diferentes para a&ntilde;adir javascript desde los m&oacute;dulos.</p>
<h3>javascript()</h3>
<p>Para a&ntilde;adir porciones de c&oacute;digo al archivo proyecto.js que se genera automaticamente con todos los archivos definidos, estos archivos se encuentran en la carpeta js del mismo m&oacute;dulo.</p>
<h3>librerias_js()</h3>
<p>Son librerias de terceros o no que se encuentran dentro de la carpeta libjs del m&oacute;dulo y son requeridas para su funcionamiento, estas librerias seran a&ntilde;adidas al proyecto antes del archivo proyecto.js.</p>
<h3>add_ext_lib()</h3>
<p>Para a&ntilde;adir librer&iacute;as de terceros tanto js como css requeridas de forma global como por ejemplo jquery, est&aacute;s ser&aacute;n las primeras en ser incluidas.</p>
<h2>Uso</h2>
<p>Para hacer que Gcm cargue un javascript del m&oacute;dulo se debe a&ntilde;adir en el m&eacute;todo que haga uso de &eacute;l la siguiente orden.</p>
<pre>$this-&gt;javascripts('archivo.js');</pre>
<p>Esto a&ntilde;ade el contenido del archivo a proyecto.js</p>
<p class="aviso">El archivo debe encontrarse en la carpeta js del m&oacute;dulo.</p>
<p>Para incluir una librer&iacute;a javascript:</p>
<pre>$this-&gt;librerias_js('jquery-1.2.6.js');</pre>
<p><span class="aviso">La librer&iacute;a debe encontrarse en la carpeta libjs del m&oacute;dulo que la a&ntilde;ade.</span></p>
<p><span class="aviso">En el caso de querer cargar una librer&iacute;a de un m&oacute;dulo diferente, podemos hacer desde $gcm</span></p>
<pre><span class="aviso">global $gcm;<br />$this-&gt;librerias_js('temas', 'jquery.dataTables.js');</span></pre>
<p>En caso de querer cargar una libreria externa tanto js como css.</p>
<pre>$this-&gt;add_ext_lib('js', Router::$base.GCM_DIR.'lib/ext/jquery/datatable/jquery.dataTables.js');<br />$this-&gt;add_ext_lib('css', Router::$base.GCM_DIR.'lib/ext/jquery/datatable/jquery.dataTables.css');</pre>
<h2>Ejemplo de uso:</h2>
<p>Un ejemplo es el m&oacute;dulo im&aacute;genes, tenemos un evento configurado para que despu&eacute;s del contenido las im&aacute;genes que se encuentren dentro del div contenido sean visualizadas con el plugin colorbox:</p>
<p>Archivo de eventos de usuario: <strong>eventos_usuarios.php</strong></p>
<pre>$eventos['postcontenido']['imagenes2thickbox'][3] = '';</pre>
<p>M&eacute;todo al que enlaza desde el m&oacute;dulo im&aacute;genes: <strong>lib/Imagenes.php</strong></p>
<pre>   /**<br />    * Enlazamos las im&aacute;genes dentro de contenido hacia thickbox<br />    */<br /><br />   function imagenes2thickbox($e, $args=FALSE) {<br /><br />      global $gcm;<br /><br />      $this-&gt;librerias_js('jquery.colorbox.js');<br />      $this-&gt;javascripts('imagenes.js');<br />      ?&gt;<br />      &lt;script&gt;<br />      addLoadEvent(function(){<br />         img2thickbox();<br />      });<br />      &lt;/script&gt;<br />      &lt;?php<br />      }<br />   }<br /><br /></pre>
<p>Archivo javascript que se carga con las funciones necesarias:<strong> js/imagenes.js</strong></p>
<pre>/**<br /> * Transformammos los enlaces de las miniaturas de im&aacute;genes para que se muestre la<br /> * ampliaci&oacute;n en la misma pagina utilizando thickbox.<br /> */<br /><br />function img2thickbox() {<br /><br />   var links = document.links;<br />   var num   = 0;<br /><br />   for (var x=0 ; x&lt;links.length ; x++ ) {<br /><br />      var tipo = links[x].href.substring(links[x].href.length-4,links[x].href.length);<br />      if ( tipo == '.gif' || tipo == '.jpg' || tipo == 'jpeg' || tipo == '.png' || tipo == 'tiff' || tipo == '.JPG' || tipo == '.GIF'  ) {<br />         var ancla = links[x];<br />         //ancla.setAttribute('onclick','verImgEnGaleria(''+links[x].href+''); return false;');<br />         // ancla.setAttribute('rel','galeria_imagenes');<br />         ancla.setAttribute('class',"galeria_imagenes");<br />         num++;<br />      }<br />   }<br /><br />   $(document).ready(function(){<br />      //Examples of how to assign the ColorBox event to elements<br />      $(".galeria_imagenes").colorbox({<br />         rel:'galeria_imagenes'<br />         , slideshow:true<br />         , slideshowSpeed: 5000<br />      });<br />   });<br /><br />}</pre>
<p>&nbsp;</p>